/*==============================================================================

   頂点管理[Mosaic.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


////////////////
//構造体
////////////////

class Mosaic
{
protected:
	XMFLOAT3	Position;		//表示座標
	XMFLOAT4	Color;			//色
	XMFLOAT2	Size;			//サイズ
	XMFLOAT2	Scale;			//拡大縮小率
	float		Rotate;			//回転角度（360表現）
	int			TexID;			//テクスチャID
	ID3D11VertexShader* VertexShader; //頂点シェーダーオブジェクト
	ID3D11PixelShader* PixelShader; //ピクセルシェーダーオブジェクト
	ID3D11InputLayout* VertexLayout; //頂点レイアウトオブジェクト

	XMFLOAT4 Parameter;

public:
	HRESULT Init(void);
	void Finalize(void);
	void Update(void);
	void Draw(void);

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
